tutorials/cases/charOnlyMoveCases/serial_stage2/system/regressionFunctions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
//
// Regression-test function objects for charOnlyMoveCases/serial.
//
// Verbatim syntax verified against:
//   gitlab.com/openfoam/core/openfoam/-/raw/master/tutorials/incompressible/
//     pisoFoam/RAS/cavity/system/FOs/FOvolFieldValue
//
// Each block emits one tab-separated row per solution write event to
//   postProcessing/<name>/<startTime>/volFieldValue.dat
//
// applications/test/regression/tools/compareScalars.py diffs every such
// .dat against the committed reference/ baseline.

regressionBase
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    regionType      all;
    postOperation   none;
    weightField     none;
    writeFields     false;     // Only the scalar reduction; no field dump.
    writePrecision  10;
    writeToFile     true;
    log             false;
    enabled         false;         // not a real FO; children override this
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;     // write only at solution write events
    writeInterval   -1;
}

// Domain-average void fraction. Increases as the solid bed burns away.
regressionPorosityAverage
{
    ${regressionBase}
    enabled         true;
    fields          (porosityF);
    operation       volAverage;
}

// Minimum void fraction (densest cell). Sensitive to bed position and packing.
regressionPorosityMin
{
    ${regressionBase}
    enabled         true;
    fields          (porosityF);
    operation       min;
}

// Volume integrals of solid species mass density [kg/m³] — gives total species
// mass [kg]. Chemistry- and mass-conservation-sensitive.
regressionSolidSpeciesIntegrals
{
    ${regressionBase}
    enabled         true;
    fields          (Ycharm Yashm Yhumm Yrubberwoodm);
    operation       volIntegrate;
}

// Solid temperature reductions. Energy-equation-sensitive.
regressionTsAverage
{
    ${regressionBase}
    enabled         true;
    fields          (Ts);
    operation       volAverage;
}

regressionTsMax
{
    ${regressionBase}
    enabled         true;
    fields          (Ts);
    operation       max;
}

regressionTsMin
{
    ${regressionBase}
    enabled         true;
    fields          (Ts);
    operation       min;
}

// ************************************************************************* //
